Public Attributes | List of all members
API_ElemCategory Struct Reference
Categories
Element category structure. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Guid  | guid
GUID of the category.
API_ElemCategoryID  | categoryID
Identifier of the category.
GS::uchar_t  | name [API_UniLongNameLen]
Localized name of the category.
Detailed Description
Element category structure.
Remarks
This structure contains the data of an element category. For available category identifiers check API_ElemCategoryID.
Member Data Documentation
◆ categoryID
 API_ElemCategory::categoryID
Identifier of the category.
◆ guid
 API_ElemCategory::guid
GUID of the category.
◆ name
 API_ElemCategory::name
Localized name of the category.